# შექმენით ფუნქცია, რომელსაც გადასცემთ მომხმარებლის გვარს.
# გვარის თითოეული ასო გადაიტანეთ ახალ სიაში. 
# შემდეგ for ციკლის გამოყენებით იმუშავეთ ამ სიაზე - მარტო ლუწ ინდექსებზე მყოფი ა
# სოები დაამატეთ ახალ სიაში. საბოლოოდ დააბრუნეთ ეს სია.
# Bonus (არაა სავალდებულო): ეს სია გარდაქმენით სთრინგად და ამ სახით დააბრუნეთ

def word(lastname):
  list = []
  even_lst = []
  for i in lastname:
    list.append(i)
  for i in range(len(list)):
    if i % 2 == 0:
      even_lst.append(list[i])
  print(even_lst)

  

word("dachi")