#for i in range(20):
    #print(i)

    # for ეს არის ციკლის keyword
    # i არის საიტერაციო ცვლადი (იტერაცია ნიშნავს გამეორებას)
    # in არის ში ხოლი in range არის დიაპაზონში
    # range(20) ნიშნავს, რომ შეიქმნება მათემათიკური მიმდინარეობა რომლის სიგრძეც არის 20
    # range არის მეთოდი რომელსაც არგუმენტად გადაეცა მნიშვნელობა 20


#i = 42
#while i < 41:
    #print(i)
    #i += 1

# i = 0 ეს არის საიტერაციო ცვლადის დეკლარაცია
# while(სანამ) ეს არის ციკლის შესაქმნელად საჭირო keyword ი
# ციკლი იმუშავებს იქამდე სანამ i ნაკლებია 41
# თითოეულ დატრიალებაზე დაიპრინტება ჩვენი საიტერაციო ცვლადი i 
# რომელიც მნიშვნელობას იზრდის 1 ით
# i += 1 ეს არის საიტერაციო ცვლადის ინკრემენტაცია (გაზრდა)
# indented ეს არის ინდენტახია (TAB გამოყოფა კედლისგან)
        


# ვთქვათ პაროლი არის 12345 და მომხმარებელმა შეიყვანა 678
#guess = int(input("enter your pasword"))
#password = 12345
#while guess != password:
    #print(guess !=  password)

for i in range(1,100):
    if i % 2 == 0:
        print(i, 'is even')
    else:
        print(i, 'is odd')
